#### RailTagentJoinOption Enumeration

---

|  |
| --- |
| See Also |

The tangent joins of the rails.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum RailTagentJoinOption ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RailTagentJoinOption ``` |

| Visual C++ |
| --- |
| ``` public enum class RailTagentJoinOption ``` |

# Members

| Member name | Description |
| --- | --- |
| AddVerticalOrHorizontalSegments | Add vertical or horizontal segments. |
| NoConnector | No connector. |
| ExtendRailsToMeet | Extend rails to meet. |

# See Also

Autodesk.Revit.DB.Architecture Namespace